{"class_name": "Functional", "config": {"name": "model_43", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 161], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_67"}, "name": "input_67", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_68"}, "name": "input_68", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_44", "trainable": true, "dtype": "float32", "units": 10, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": {"class_name": "L1", "config": {"l1": 9.999999747378752e-05}}, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_44", "inbound_nodes": [[["input_67", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_44", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_44", "inbound_nodes": [[["input_68", 0, 0, {}], ["dense_44", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_45", "trainable": true, "dtype": "float32", "units": 161, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_45", "inbound_nodes": [[["concatenate_44", 0, 0, {}]]]}], "input_layers": [["input_68", 0, 0], ["input_67", 0, 0]], "output_layers": [["dense_45", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}